

# 변수 선택법 : 전진, 후진 선택법
- `step()` 사용 : 전진, 후진, 양측

# 상관 분석
# 피어슨 상관계수 : 두 확률변수 X와 Y의 선형관계 크기 측정(비선형적 상관관계 측정 불가)
data(mtcars)

cor(mtcars$drat, mtcars$disp)
# [1] -0.7102139

install.packages("Hmisc")
library(Hmisc)

rcorr(as.matrix(mtcars), type="pearson") # 모든 변수들 사이의 솽관계수 및 H0 : p=0에 대한 p값 출력
cov(mtcars) # 공분산


# 스피어만 상관계수 : 두 변수를 모두 순위로 변환시킨 후, 두 순위 사잉의 피어슨 상관계수로 정의

rcorr(as.matrix(mtcars), type="spearman") # 모든 변수들 사이의 솽관계수 및 H0 : p=0에 대한 p값 출력

# 다차원 척도법(MDS)
# 여러 대상 간의 거리가 주어져 있을 때, 대상들을 동일한 상대적 거리를 가진 실수공간의 점들로 배치시키는 방법

data(eurodist)
eurodist
#                Athens Barcelona Brussels Calais Cherbourg Cologne Copenhagen Geneva Gibraltar Hamburg Hook of Holland Lisbon Lyons Madrid
# Barcelona         3313                                                                                                                    
# Brussels          2963      1318                                                                                                          
# Calais            3175      1326      204                                                                                                 
# Cherbourg         3339      1294      583    460                                                                                          
# Cologne           2762      1498      206    409       785                                                                                
# Copenhagen        3276      2218      966   1136      1545     760                                                                        
# Geneva            2610       803      677    747       853    1662       1418                                                             
# Gibraltar         4485      1172     2256   2224      2047    2436       3196   1975                                                      
# Hamburg           2977      2018      597    714      1115     460        460   1118      2897                                            
# Hook of Holland   3030      1490      172    330       731     269        269    895      2428     550                                    
# Lisbon            4532      1305     2084   2052      1827    2290       2971   1936       676    2671            2280                    
# Lyons             2753       645      690    739       789     714       1458    158      1817    1159             863   1178             
# Madrid            3949       636     1558   1550      1347    1764       2498   1439       698    2198            1730    668  1281       
# Marseilles        2865       521     1011   1059      1101    1035       1778    425      1693    1479            1183   1762   320   1157
# Milan             2282      1014      925   1077      1209     911       1537    328      2185    1238            1098   2250   328   1724
# Munich            2179      1365      747    977      1160     583       1104    591      2565     805             851   2507   724   2010
# Paris             3000      1033      285    280       340     465       1176    513      1971     877             457   1799   471   1273
# Rome               817      1460     1511   1662      1794    1497       2050    995      2631    1751            1683   2700  1048   2097
# Stockholm         3927      2868     1616   1786      2196    1403        650   2068      3886     949            1500   3231  2108   3188
# Vienna            1991      1802     1175   1381      1588     937       1455   1019      2974    1155            1205   2937  1157   2409
# Marseilles Milan Munich Paris Rome Stockholm
# Barcelona                                                   
# Brussels                                                    
# Calais                                                      
# Cherbourg                                                   
# Cologne                                                     
# Copenhagen                                                  
# Geneva                                                      
# Gibraltar                                                   
# Hamburg                                                     
# Hook of Holland                                             
# Lisbon                                                      
# Lyons                                                       
# Madrid                                                      
# Marseilles                                                  
# Milan                  618                                  
# Munich                1109   331                            
# Paris                  792   856    821                     
# Rome                  1011   586    946  1476               
# Stockholm             2428  2187   1754  1827 2707          
# Vienna                1363   898    428  1249 1209      2105

loc <- cmdscale(eurodist)
x <- loc[,1]
y <- loc[,2]
plot(x,y,type="n",main="eurodist")
text(x,y,rownames(loc),cex=0.8)
abline(v=0,h=0)

# 주성분 분석(PCA)
# 상관 관계가 있는 고차원 자료를 자료의 변동을 최대한 보존하는 저차원 자료로 변환시키는 방법, 차원 축약
# 주성분들은 서로 상관관계가 없고, 주성분들의 분산의 합은 X_i들의 분산의 합과 같다.

data("USArrests")
summary(USArrests)
#     Murder          Assault         UrbanPop          Rape      
# Min.   : 0.800   Min.   : 45.0   Min.   :32.00   Min.   : 7.30  
# 1st Qu.: 4.075   1st Qu.:109.0   1st Qu.:54.50   1st Qu.:15.07  
# Median : 7.250   Median :159.0   Median :66.00   Median :20.10  
# Mean   : 7.788   Mean   :170.8   Mean   :65.54   Mean   :21.23  
# 3rd Qu.:11.250   3rd Qu.:249.0   3rd Qu.:77.75   3rd Qu.:26.18  
# Max.   :17.400   Max.   :337.0   Max.   :91.00   Max.   :46.00 

fit <- princomp(USArrests, cor=TRUE)
summary(fit)
# Importance of components:
#                           Comp.1    Comp.2    Comp.3     Comp.4
# Standard deviation     1.5748783 0.9948694 0.5971291 0.41644938
# Proportion of Variance 0.6200604 0.2474413 0.0891408 0.04335752
# Cumulative Proportion  0.6200604 0.8675017 0.9566425 1.00000000

loadings(fit)
# Loadings:
#           Comp.1 Comp.2 Comp.3 Comp.4
# Murder    0.536  0.418  0.341  0.649
# Assault   0.583  0.188  0.268 -0.743
# UrbanPop  0.278 -0.873  0.378  0.134
# Rape      0.543 -0.167 -0.818       
# 
#                Comp.1 Comp.2 Comp.3 Comp.4
# SS loadings      1.00   1.00   1.00   1.00
# Proportion Var   0.25   0.25   0.25   0.25
# Cumulative Var   0.25   0.50   0.75   1.00

# 주성분분석은 R함수 `princomp()`를 이용하여 수행됨
# `cor=TRUE` 옵션은 주성분분석을 공분산행렬이 아닌 상관계수 행렬을 사용하여 수행하도록 함
# `summary(fit)`의 결과는 4개의 주성분의 표준편차, 분산의 비율 등을 나타냄
# `loadings(fit)`함수는 주성분들의 로딩 벡터들을 나타냄

# Y_1 = 0.536*Murder + 0.583*Assault + 0.278*UrbanPop + 0.543*Rape
# Y_2 = 0.418*Murder + 0.188*Assault - 0.873*UrbanPop - 0.167*Rape

plot(fit, type="lines")

# `plot(fit)`함수는 각 주성분의 분산의 크기를 나타냄, scree plot 라고도 함
# 주성분의 분산의 감소가 급격하게 줄어들어 주성분의 개수를 늘릴 때 얻게되는 정보의 양이 상대적으로 미미한 지점에서 주성분 개수를 정하는 것이 하나의 방법
# 일반적으로는 총 분산의 비율이 70~90% 사이에서 선택함

fit$scores
#                    Comp.1      Comp.2      Comp.3       Comp.4
# Alabama         0.98556588  1.13339238  0.44426879  0.156267145
# Alaska          1.95013775  1.07321326 -2.04000333 -0.438583440
# Arizona         1.76316354 -0.74595678 -0.05478082 -0.834652924
# Arkansas       -0.14142029  1.11979678 -0.11457369 -0.182810896
# California      2.52398013 -1.54293399 -0.59855680 -0.341996478
# Colorado        1.51456286 -0.98755509 -1.09500699  0.001464887
# Connecticut    -1.35864746 -1.08892789  0.64325757 -0.118469414
# Delaware        0.04770931 -0.32535892  0.71863294 -0.881977637
# Florida         3.01304227  0.03922851  0.57682949 -0.096284752
# Georgia         1.63928304  1.27894240  0.34246008  1.076796812
# Hawaii         -0.91265715 -1.57046001 -0.05078189  0.902806864
# Idaho          -1.63979985  0.21097292 -0.25980134 -0.499104101
# Illinois        1.37891072 -0.68184119  0.67749564 -0.122021292
# Indiana        -0.50546136 -0.15156254 -0.22805484  0.424665700
# Iowa           -2.25364607 -0.10405407 -0.16456432  0.017555916
# Kansas         -0.79688112 -0.27016470 -0.02555331  0.206496428
# Kentucky       -0.75085907  0.95844029  0.02836942  0.670556671
# Louisiana       1.56481798  0.87105466  0.78348036  0.454728038
# Maine          -2.39682949  0.37639158  0.06568239 -0.330459817
# Maryland        1.76336939  0.42765519  0.15725013 -0.559069521
# Massachusetts  -0.48616629 -1.47449650  0.60949748 -0.179598963
# Michigan        2.10844115 -0.15539682 -0.38486858  0.102372019
# Minnesota      -1.69268181 -0.63226125 -0.15307043  0.067316885
# Mississippi     0.99649446  2.39379599  0.74080840  0.215508013
# Missouri        0.69678733 -0.26335479 -0.37744383  0.225824461
# Montana        -1.18545191  0.53687437 -0.24688932  0.123742227
# Nebraska       -1.26563654 -0.19395373 -0.17557391  0.015892888
# Nevada          2.87439454 -0.77560020 -1.16338049  0.314515476
# New Hampshire  -2.38391541 -0.01808229 -0.03685539 -0.033137338
# New Jersey      0.18156611 -1.44950571  0.76445355  0.243382700
# New Mexico      1.98002375  0.14284878 -0.18369218 -0.339533597
# New York        1.68257738 -0.82318414  0.64307509 -0.013484369
# North Carolina  1.12337861  2.22800338  0.86357179 -0.954381667
# North Dakota   -2.99222562  0.59911882 -0.30127728 -0.253987327
# Ohio           -0.22596542 -0.74223824  0.03113912  0.473915911
# Oklahoma       -0.31178286 -0.28785421  0.01530979  0.010332321
# Oregon          0.05912208 -0.54141145 -0.93983298 -0.237780688
# Pennsylvania   -0.88841582 -0.57110035  0.40062871  0.359061124
# Rhode Island   -0.86377206 -1.49197842  1.36994570 -0.613569430
# South Carolina  1.32072380  1.93340466  0.30053779 -0.131466685
# South Dakota   -1.98777484  0.82334324 -0.38929333 -0.109571764
# Tennessee       0.99974168  0.86025130 -0.18808295  0.652864291
# Texas           1.35513821 -0.41248082  0.49206886  0.643195491
# Utah           -0.55056526 -1.47150461 -0.29372804 -0.082314047
# Vermont        -2.80141174  1.40228806 -0.84126309 -0.144889914
# Virginia       -0.09633491  0.19973529 -0.01171254  0.211370813
# Washington     -0.21690338 -0.97012418 -0.62487094 -0.220847793
# West Virginia  -2.10858541  1.42484670 -0.10477467  0.131908831
# Wisconsin      -2.07971417 -0.61126862  0.13886500  0.184103743
# Wyoming        -0.62942666  0.32101297  0.24065923 -0.166651801

biplot(fit)

# `fit$scores` : 각 관측치를 주성분들로 표현한 값
# `biplot(fit)` : 관측치들을 첫 번째와 두 번째 주성분의 좌표에 그린 그림
# 해석 예 : 첫 번째 주성분의 값이 작을수록 세 가지 범죄 발생율이 큰 주이고 두 번째 주성분 값이 작을수록 도심인구 비율이 큰 주라고 볼 수 있다
